# pandas_basic

## 1. pandas 로딩

In [1]:
import pandas as pd
import numpy as np

## 2. pandas의 Series와 Dataframe

In [2]:
pd.Series(np.array([1, 2, 3, 4]))

0    1
1    2
2    3
3    4
dtype: int64

In [3]:
pd.Series([1, 2, 3, 4])

0    1
1    2
2    3
3    4
dtype: int64

In [4]:
a = [1, 2, 3, 4]
pd.Series(a)

0    1
1    2
2    3
3    4
dtype: int64

In [5]:
a = pd.Series(a)
type(a)

pandas.core.series.Series

In [6]:
company1 = [['삼성', 2000, '스마트폰'],
           ['현대', 2500, '자동차'],
           ['LG', 3000, '건조기']]
pd.DataFrame(company1)

    0     1     2
0  삼성  2000  스마트폰
1  현대  2500   자동차
2  LG  3000   건조기

In [7]:
df1 = pd.DataFrame(company1)
df1

    0     1     2
0  삼성  2000  스마트폰
1  현대  2500   자동차
2  LG  3000   건조기

In [8]:
df1.columns = ['기업명', '매출액', '업종']
df1

  기업명   매출액    업종
0  삼성  2000  스마트폰
1  현대  2500   자동차
2  LG  3000   건조기

In [9]:
company2 = {'기업명':['삼성', '현대', 'LG'], 
            '매출액': [2000, 2500, 3000], 
            '업종': ['스마트폰', '자동차', '건조기']
           }

In [10]:
df2 = pd.DataFrame(company2)
df2

  기업명   매출액    업종
0  삼성  2000  스마트폰
1  현대  2500   자동차
2  LG  3000   건조기

In [11]:
df1.index = df1['기업명']
df1

    기업명   매출액    업종
기업명
삼성   삼성  2000  스마트폰
현대   현대  2500   자동차
LG   LG  3000   건조기

In [12]:
df1['매출액']

기업명
삼성    2000
현대    2500
LG    3000
Name: 매출액, dtype: int64

In [13]:
type(df1['매출액'])

pandas.core.series.Series

## [문제] 다음 정보를 데이터 프레임으로 만들기

In [14]:
bts = [
    ["진", "서브보컬", 28],
    ["슈가", "리드래퍼", 28],
    ["제이홉", "서브래퍼", 27],
    ["RM", "리더", 26],
    ["지민", "리드보컬", 25],
    ["뷔", "리드댄서", 25],
    ["정국", "리드댄서",23]
]
df_bts = pd.DataFrame(bts)
df_bts.columns = ["이름", "포지션", "나이"]
df_bts

    이름   포지션  나이
0    진  서브보컬  28
1   슈가  리드래퍼  28
2  제이홉  서브래퍼  27
3   RM    리더  26
4   지민  리드보컬  25
5    뷔  리드댄서  25
6   정국  리드댄서  23

In [16]:
num = np.arange(1, 40, 2).reshape(5, 4)
df_num = pd.DataFrame(num)
df_num.columns = ["1열", "2열", "3열", "4열"]
df_num

   1열  2열  3열  4열
0   1   3   5   7
1   9  11  13  15
2  17  19  21  23
3  25  27  29  31
4  33  35  37  39